# Data mining, Project group Nestlé

## Happiness Report

In [0]:
# import libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [0]:
# import dataframes
df_WHR = pd.read_excel("https://s3.amazonaws.com/happiness-report/2019/Chapter2OnlineData.xls")
df_TauxChomage = pd.read_csv("https://raw.githubusercontent.com/hackan98/DMML2019_Team_Nestle/master/data/tauxchomage.csv")
df_TauxPauvrete = pd.read_csv("https://raw.githubusercontent.com/hackan98/DMML2019_Team_Nestle/master/data/taux_pauvrete.csv")
df_TauxMortaliteInfantile = pd.read_csv("https://raw.githubusercontent.com/hackan98/DMML2019_Team_Nestle/master/data/taux_mortalite_infantile.csv")
df_TauxSuicide = pd.read_csv("https://raw.githubusercontent.com/hackan98/DMML2019_Team_Nestle/master/data/tauxsuicide.csv")

In [3]:
df_WHR.columns

Index(['Country name', 'Year', 'Life Ladder', 'Log GDP per capita',
       'Social support', 'Healthy life expectancy at birth',
       'Freedom to make life choices', 'Generosity',
       'Perceptions of corruption', 'Positive affect', 'Negative affect',
       'Confidence in national government', 'Democratic Quality',
       'Delivery Quality', 'Standard deviation of ladder by country-year',
       'Standard deviation/Mean of ladder by country-year',
       'GINI index (World Bank estimate)',
       'GINI index (World Bank estimate), average 2000-16',
       'gini of household income reported in Gallup, by wp5-year',
       'Most people can be trusted, Gallup',
       'Most people can be trusted, WVS round 1981-1984',
       'Most people can be trusted, WVS round 1989-1993',
       'Most people can be trusted, WVS round 1994-1998',
       'Most people can be trusted, WVS round 1999-2004',
       'Most people can be trusted, WVS round 2005-2009',
       'Most people can be trusted, WVS round 2010-2014'],
      dtype='object')

### Features correlations with target value Life Ladder (happinness score)

In [4]:
df_WHR.corr(method="pearson", min_periods=20)["Life Ladder"].sort_values(ascending=False)

Life Ladder                                                 1.000000
Log GDP per capita                                          0.779064
Healthy life expectancy at birth                            0.736797
Delivery Quality                                            0.707940
Social support                                              0.702461
Democratic Quality                                          0.614572
Most people can be trusted, WVS round 1981-1984             0.554803
Positive affect                                             0.543377
Freedom to make life choices                                0.520988
Most people can be trusted, WVS round 2005-2009             0.477312
Most people can be trusted, WVS round 1994-1998             0.475632
Most people can be trusted, WVS round 2010-2014             0.348629
Most people can be trusted, WVS round 1999-2004             0.266804
Generosity                                                  0.197423
Most people can be trusted, Gallup                          0.189750
Year                                                       -0.007075
Confidence in national government                          -0.092046
GINI index (World Bank estimate)                           -0.106342
Standard deviation of ladder by country-year               -0.184659
GINI index (World Bank estimate), average 2000-16          -0.194244
Most people can be trusted, WVS round 1989-1993            -0.269036
Negative affect                                            -0.279331
gini of household income reported in Gallup, by wp5-year   -0.304404
Perceptions of corruption                                  -0.420750
Standard deviation/Mean of ladder by country-year          -0.753971
Name: Life Ladder, dtype: float64

In [5]:
df_WHR.corr(method="pearson", min_periods=20)["Life Ladder"].abs().sort_values(ascending=False)

Life Ladder                                                 1.000000
Log GDP per capita                                          0.779064
Standard deviation/Mean of ladder by country-year           0.753971
Healthy life expectancy at birth                            0.736797
Delivery Quality                                            0.707940
Social support                                              0.702461
Democratic Quality                                          0.614572
Most people can be trusted, WVS round 1981-1984             0.554803
Positive affect                                             0.543377
Freedom to make life choices                                0.520988
Most people can be trusted, WVS round 2005-2009             0.477312
Most people can be trusted, WVS round 1994-1998             0.475632
Perceptions of corruption                                   0.420750
Most people can be trusted, WVS round 2010-2014             0.348629
gini of household income reported in Gallup, by wp5-year    0.304404
Negative affect                                             0.279331
Most people can be trusted, WVS round 1989-1993             0.269036
Most people can be trusted, WVS round 1999-2004             0.266804
Generosity                                                  0.197423
GINI index (World Bank estimate), average 2000-16           0.194244
Most people can be trusted, Gallup                          0.189750
Standard deviation of ladder by country-year                0.184659
GINI index (World Bank estimate)                            0.106342
Confidence in national government                           0.092046
Year                                                        0.007075
Name: Life Ladder, dtype: float64

In [6]:
# Droping the features according the correlation
to_drop = [ 'Social support','Freedom to make life choices', 'Generosity',
       'Perceptions of corruption', 'Positive affect', 'Negative affect',
       'Confidence in national government', 'Democratic Quality',
       'Delivery Quality', 'Standard deviation of ladder by country-year',
       'Standard deviation/Mean of ladder by country-year',
       'GINI index (World Bank estimate)',
       'GINI index (World Bank estimate), average 2000-16',
       'gini of household income reported in Gallup, by wp5-year',
       'Most people can be trusted, Gallup',
       'Most people can be trusted, WVS round 1981-1984',
       'Most people can be trusted, WVS round 1989-1993',
       'Most people can be trusted, WVS round 1994-1998',
       'Most people can be trusted, WVS round 1999-2004',
       'Most people can be trusted, WVS round 2005-2009',
       'Most people can be trusted, WVS round 2010-2014',]

df_WHR.drop(to_drop, inplace=True, axis=1)
df_WHR

     Country name  Year  ...  Log GDP per capita  Healthy life expectancy at birth
0     Afghanistan  2008  ...            7.168690                         50.799999
1     Afghanistan  2009  ...            7.333790                         51.200001
2     Afghanistan  2010  ...            7.386629                         51.599998
3     Afghanistan  2011  ...            7.415019                         51.919998
4     Afghanistan  2012  ...            7.517126                         52.240002
...           ...   ...  ...                 ...                               ...
1699     Zimbabwe  2014  ...            7.562753                         52.380001
1700     Zimbabwe  2015  ...            7.556052                         53.799999
1701     Zimbabwe  2016  ...            7.538829                         54.400002
1702     Zimbabwe  2017  ...            7.549491                         55.000000
1703     Zimbabwe  2018  ...            7.553395                         55.599998

[1704 rows x 5 columns]

In [7]:
df_WHR.dropna(inplace=True)
df_WHR

     Country name  Year  ...  Log GDP per capita  Healthy life expectancy at birth
0     Afghanistan  2008  ...            7.168690                         50.799999
1     Afghanistan  2009  ...            7.333790                         51.200001
2     Afghanistan  2010  ...            7.386629                         51.599998
3     Afghanistan  2011  ...            7.415019                         51.919998
4     Afghanistan  2012  ...            7.517126                         52.240002
...           ...   ...  ...                 ...                               ...
1699     Zimbabwe  2014  ...            7.562753                         52.380001
1700     Zimbabwe  2015  ...            7.556052                         53.799999
1701     Zimbabwe  2016  ...            7.538829                         54.400002
1702     Zimbabwe  2017  ...            7.549491                         55.000000
1703     Zimbabwe  2018  ...            7.553395                         55.599998

[1664 rows x 5 columns]

### Unemployement rate data set

In [8]:
df_TauxChomage

    LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  TIME      Value Flag Codes
0        AUS     UNEMP     TOT   PC_LF         A  2006   4.785240        NaN
1        AUS     UNEMP     TOT   PC_LF         A  2007   4.379151        NaN
2        AUS     UNEMP     TOT   PC_LF         A  2008   4.234330        NaN
3        AUS     UNEMP     TOT   PC_LF         A  2009   5.560385        NaN
4        AUS     UNEMP     TOT   PC_LF         A  2010   5.213340        NaN
..       ...       ...     ...     ...       ...   ...        ...        ...
555      LTU     UNEMP     TOT   PC_LF         A  2014  10.699690        NaN
556      LTU     UNEMP     TOT   PC_LF         A  2015   9.119895        NaN
557      LTU     UNEMP     TOT   PC_LF         A  2016   7.860914        NaN
558      LTU     UNEMP     TOT   PC_LF         A  2017   7.071820        NaN
559      LTU     UNEMP     TOT   PC_LF         A  2018   6.152077        NaN

[560 rows x 8 columns]

In [0]:
#here we check the unique country codes in the dataframe
unique_country_code1 = df_TauxChomage.LOCATION.unique()
unique_country_code1

In [0]:
#we create a map of the country codes and assign the country name
country1={
'AUS':'Australia',
'AUT':'Austria',
'BEL':'Belgium',
'CAN':'Canada',
'CZE':'Czech Republic',
'DNK':'Denmark',
'FIN':'Finland',
'FRA':'France',
'DEU':'Germany',
'GRC':'Greece',
'HUN':'Hungary',
'ISL':'Iceland',
'IRL':'Ireland',
'ITA':'Italy',
'JPN':'Japan',
'KOR':'Korea',
'LUX':'Luxembourg',
'MEX':'Mexico',
'NLD':'Netherlands',
'NZL':'New Zealand',
'NOR':'Norway',
'POL':'Poland',
'PRT':'Puerto Rico',
'SVK':'Slovakia',
'ESP':'Spain',
'SWE':'Sweden',
'CHE':'Switzerland',
'TUR':'Turkey',
'GBR':'United Kingdom',
'USA':'United States',
'BRA':'Brasil',
'CHL': 'Chile',
'EST':'Estonia',
'IDN':'Indonesia',
'ISR':'Israel',
'RUS':'Russia',
'SVN':'Slovenia',
'ZAF':'South Africa',
'COL':'Colombia',
'LVA':'Latvia',
'LTU':'Lithuania'
}

In [10]:
df_TauxChomage['Country'] = df_TauxChomage['LOCATION'].map(country1)
df_TauxChomage

    LOCATION INDICATOR SUBJECT MEASURE  ...  TIME      Value  Flag Codes    Country
0        AUS     UNEMP     TOT   PC_LF  ...  2006   4.785240         NaN  Australia
1        AUS     UNEMP     TOT   PC_LF  ...  2007   4.379151         NaN  Australia
2        AUS     UNEMP     TOT   PC_LF  ...  2008   4.234330         NaN  Australia
3        AUS     UNEMP     TOT   PC_LF  ...  2009   5.560385         NaN  Australia
4        AUS     UNEMP     TOT   PC_LF  ...  2010   5.213340         NaN  Australia
..       ...       ...     ...     ...  ...   ...        ...         ...        ...
555      LTU     UNEMP     TOT   PC_LF  ...  2014  10.699690         NaN  Lithuania
556      LTU     UNEMP     TOT   PC_LF  ...  2015   9.119895         NaN  Lithuania
557      LTU     UNEMP     TOT   PC_LF  ...  2016   7.860914         NaN  Lithuania
558      LTU     UNEMP     TOT   PC_LF  ...  2017   7.071820         NaN  Lithuania
559      LTU     UNEMP     TOT   PC_LF  ...  2018   6.152077         NaN  Lithuania

[560 rows x 9 columns]

In [11]:
#drop columns
to_drop = ['LOCATION', 'INDICATOR', 'SUBJECT', 'MEASURE', 'FREQUENCY', 'Flag Codes']
df_TauxChomage.drop(to_drop, inplace=True, axis=1)
df_TauxChomage

     TIME      Value    Country
0    2006   4.785240  Australia
1    2007   4.379151  Australia
2    2008   4.234330  Australia
3    2009   5.560385  Australia
4    2010   5.213340  Australia
..    ...        ...        ...
555  2014  10.699690  Lithuania
556  2015   9.119895  Lithuania
557  2016   7.860914  Lithuania
558  2017   7.071820  Lithuania
559  2018   6.152077  Lithuania

[560 rows x 3 columns]

In [12]:
#here we remove the NaN values
df_TauxChomage.dropna(inplace=True)
df_TauxChomage

     TIME      Value    Country
0    2006   4.785240  Australia
1    2007   4.379151  Australia
2    2008   4.234330  Australia
3    2009   5.560385  Australia
4    2010   5.213340  Australia
..    ...        ...        ...
555  2014  10.699690  Lithuania
556  2015   9.119895  Lithuania
557  2016   7.860914  Lithuania
558  2017   7.071820  Lithuania
559  2018   6.152077  Lithuania

[521 rows x 3 columns]

### Poverty rate data set

In [13]:
df_TauxPauvrete

    LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  TIME  Value Flag Codes
0        AUS   POVERTY     TOT      RT         A  2012  0.140        NaN
1        AUS   POVERTY     TOT      RT         A  2014  0.128        NaN
2        AUS   POVERTY     TOT      RT         A  2016  0.121        NaN
3        AUT   POVERTY     TOT      RT         A  2007  0.097        NaN
4        AUT   POVERTY     TOT      RT         A  2008  0.092        NaN
..       ...       ...     ...     ...       ...   ...    ...        ...
303      CRI   POVERTY     TOT      RT         A  2014  0.215        NaN
304      CRI   POVERTY     TOT      RT         A  2015  0.206        NaN
305      CRI   POVERTY     TOT      RT         A  2016  0.209        NaN
306      CRI   POVERTY     TOT      RT         A  2017  0.204        NaN
307      CRI   POVERTY     TOT      RT         A  2018  0.209        NaN

[308 rows x 8 columns]

In [14]:
unique_country_code2 = df_TauxPauvrete.LOCATION.unique()
unique_country_code2

array(['AUS', 'AUT', 'BEL', 'CAN', 'CZE', 'DNK', 'FIN', 'FRA', 'DEU',
       'GRC', 'HUN', 'ISL', 'IRL', 'ITA', 'KOR', 'LUX', 'MEX', 'NLD',
       'NZL', 'NOR', 'POL', 'PRT', 'SVK', 'ESP', 'SWE', 'CHE', 'TUR',
       'GBR', 'USA', 'EST', 'ISR', 'SVN', 'JPN', 'CHL', 'LVA', 'LTU',
       'BRA', 'CHN', 'IND', 'RUS', 'ZAF', 'CRI'], dtype=object)

In [0]:
country2={
'AUS':'Australia',
'AUT':'Austria',
'BEL':'Belgium',
'CAN':'Canada',
'CZE':'Czech Republic',
'DNK':'Denmark',
'FIN':'Finland',
'FRA':'France',
'DEU':'Germany',
'GRC':'Greece',
'HUN':'Hungary',
'ISL':'Iceland',
'IRL':'Ireland',
'ITA':'Italy',
'KOR':'Korea',
'LUX':'Luxembourg',
'MEX':'Mexico',
'NLD':'Netherlands',
'NZL':'New Zealand',
'NOR':'Norway',
'POL':'Poland',
'PRT':'Puerto Rico',
'SVK':'Slovakia',
'ESP':'Spain',
'SWE':'Sweden',
'CHE':'Switzerland',
'TUR':'Turkey',
'GBR':'United Kingdom',
'USA':'United States',
'BRA':'Brasil',
'CHL': 'Chile',
'EST':'Estonia',
'IDN':'Indonesia',
'ISR':'Israel',
'RUS':'Russia',
'SVN':'Slovenia',
'JPN':'Japan',
'ZAF':'South Africa',
'COL':'Colombia',
'LVA':'Latvia',
'LTU':'Lithuania',
'CRI':'Costa rica',
'IND':'India',
'CHN':'China'
}

In [16]:
df_TauxPauvrete['COUNTRY'] = df_TauxPauvrete['LOCATION'].map(country2)
df_TauxPauvrete

    LOCATION INDICATOR SUBJECT MEASURE  ...  TIME  Value  Flag Codes     COUNTRY
0        AUS   POVERTY     TOT      RT  ...  2012  0.140         NaN   Australia
1        AUS   POVERTY     TOT      RT  ...  2014  0.128         NaN   Australia
2        AUS   POVERTY     TOT      RT  ...  2016  0.121         NaN   Australia
3        AUT   POVERTY     TOT      RT  ...  2007  0.097         NaN     Austria
4        AUT   POVERTY     TOT      RT  ...  2008  0.092         NaN     Austria
..       ...       ...     ...     ...  ...   ...    ...         ...         ...
303      CRI   POVERTY     TOT      RT  ...  2014  0.215         NaN  Costa rica
304      CRI   POVERTY     TOT      RT  ...  2015  0.206         NaN  Costa rica
305      CRI   POVERTY     TOT      RT  ...  2016  0.209         NaN  Costa rica
306      CRI   POVERTY     TOT      RT  ...  2017  0.204         NaN  Costa rica
307      CRI   POVERTY     TOT      RT  ...  2018  0.209         NaN  Costa rica

[308 rows x 9 columns]

In [17]:
to_drop = ['INDICATOR', 'SUBJECT', 'MEASURE', 'FREQUENCY', 'Flag Codes','LOCATION']
df_TauxPauvrete.drop(to_drop, inplace=True, axis=1)
df_TauxPauvrete

     TIME  Value     COUNTRY
0    2012  0.140   Australia
1    2014  0.128   Australia
2    2016  0.121   Australia
3    2007  0.097     Austria
4    2008  0.092     Austria
..    ...    ...         ...
303  2014  0.215  Costa rica
304  2015  0.206  Costa rica
305  2016  0.209  Costa rica
306  2017  0.204  Costa rica
307  2018  0.209  Costa rica

[308 rows x 3 columns]

In [0]:
df_TauxPauvrete.dropna(inplace=True)

In [19]:
df_TauxPauvrete

     TIME  Value     COUNTRY
0    2012  0.140   Australia
1    2014  0.128   Australia
2    2016  0.121   Australia
3    2007  0.097     Austria
4    2008  0.092     Austria
..    ...    ...         ...
303  2014  0.215  Costa rica
304  2015  0.206  Costa rica
305  2016  0.209  Costa rica
306  2017  0.204  Costa rica
307  2018  0.209  Costa rica

[308 rows x 3 columns]

### Child mortality rate data set

In [0]:
df_TauxMortaliteInfantile.head()

,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
0,AUS,INFANTMORTALITY,TOT,DEATH_1000BIRTH,A,2006,4.7,NaN
1,AUS,INFANTMORTALITY,TOT,DEATH_1000BIRTH,A,2007,4.1,NaN
2,AUS,INFANTMORTALITY,TOT,DEATH_1000BIRTH,A,2008,4.1,NaN
3,AUS,INFANTMORTALITY,TOT,DEATH_1000BIRTH,A,2009,4.2,NaN
4,AUS,INFANTMORTALITY,TOT,DEATH_1000BIRTH,A,2010,4.1,NaN

### Suicide rate data set

In [0]:
df_TauxSuicide

    LOCATION INDICATOR SUBJECT    MEASURE FREQUENCY  TIME  Value Flag Codes
0        AUS   SUICIDE     TOT  100000PER         A  2006   10.5        NaN
1        AUS   SUICIDE     TOT  100000PER         A  2007   10.6        NaN
2        AUS   SUICIDE     TOT  100000PER         A  2008   10.9        NaN
3        AUS   SUICIDE     TOT  100000PER         A  2009   10.7        NaN
4        AUS   SUICIDE     TOT  100000PER         A  2010   10.9        NaN
..       ...       ...     ...        ...       ...   ...    ...        ...
426      CRI   SUICIDE     TOT  100000PER         A  2010    7.1        NaN
427      CRI   SUICIDE     TOT  100000PER         A  2011    7.1        NaN
428      CRI   SUICIDE     TOT  100000PER         A  2012    6.7        NaN
429      CRI   SUICIDE     TOT  100000PER         A  2013    7.0        NaN
430      CRI   SUICIDE     TOT  100000PER         A  2014    5.8        NaN

[431 rows x 8 columns]

In [0]:
df_TauxSuicide.columns

Index(['LOCATION', 'INDICATOR', 'SUBJECT', 'MEASURE', 'FREQUENCY', 'TIME',
       'Value', 'Flag Codes'],
      dtype='object')

In [0]:
to_drop = [ 'INDICATOR', 'SUBJECT', 'MEASURE', 'FREQUENCY', 'Flag Codes']

df_TauxSuicide.drop(to_drop, inplace=True, axis=1)

In [0]:
df_TauxSuicide

    LOCATION  TIME  Value
0        AUS  2006   10.5
1        AUS  2007   10.6
2        AUS  2008   10.9
3        AUS  2009   10.7
4        AUS  2010   10.9
..       ...   ...    ...
426      CRI  2010    7.1
427      CRI  2011    7.1
428      CRI  2012    6.7
429      CRI  2013    7.0
430      CRI  2014    5.8

[431 rows x 3 columns]

In [0]:
df_TauxSuicide.dropna()

    LOCATION  TIME  Value
0        AUS  2006   10.5
1        AUS  2007   10.6
2        AUS  2008   10.9
3        AUS  2009   10.7
4        AUS  2010   10.9
..       ...   ...    ...
426      CRI  2010    7.1
427      CRI  2011    7.1
428      CRI  2012    6.7
429      CRI  2013    7.0
430      CRI  2014    5.8

[431 rows x 3 columns]